blog/2016/12/elixir-hot-swapping/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-18 Thu 16:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Elixir/Erlang Hot Swapping Code</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="kb" />
<meta name="description" content="Hot code reloading with Elixir and Erlang"
 />
<meta charset="utf-8">

<meta name="author" content="Kenny Ballou">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<title>~kb</title>

<link rel="canonical" href="/" />
<link href="/index.xml" rel="alternate" type="application/rss+xml"
      title="~kb/blog" />

<link rel="stylesheet" href="/css/simple.css" />
<link rel="stylesheet" href="/css/simple.add.css" />
<link rel="stylesheet" href="/css/katex.css" />
<link rel="stylesheet" href="/css/fa-all.css" />
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://kennyballou.com/blog"> UP </a>
 |
 <a accesskey="H" href="https://kennyballou.com/"> HOME </a>
</div><header id="" class="status">
<nav>
  <a href="/about.html">
    <i class="fade fas fa-user-circle"></i>
  </a>
  <a href="https://git.sr.ht/~kennyballou/"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fas fa-code-branch fa-1x"></i>
  </a>
  <a href="https://github.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-github fa-1x"></i>
  </a>
  <a href="https://bitbucket.org/kballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-bitbucket fa-1x"></i>
  </a>
  <a href="https://linkedin.com/in/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-linkedin-in fa-1x"></i>
  </a>
  <a href="/support.html">
    <i class="fade fas fa-heart fa-1x"></i>
  </a>
  <a href="/resume.pdf"
     target="_blank">
    <i class="fade far fa-file-pdf"></i>
  </a>
  <a href="/B74CC4B41148C3DB364BC21182D94B35744E1B34.asc"
     target="_blank">
    <i class="fade fas fa-key"></i>
  </a>
  <a href="/index.xml" rel="alternate"
     type="application/rss+xml">
    <i class="fade fas fa-rss fa-1x"></i>
  </a>
</nav>
</header>
<div id="main">
<h1 class="title">Elixir/Erlang Hot Swapping Code</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1916d6b">Hot Code Swapping: Basics</a>
<ul>
<li><a href="#org7474a29">Example</a></li>
<li><a href="#org78361c9">Example: <code>iex</code></a></li>
</ul>
</li>
<li><a href="#org6815fb9">Relups</a>
<ul>
<li><a href="#orgd5c368f">Erlang Applications</a></li>
<li><a href="#org20dfb92">Erlang Releases</a></li>
<li><a href="#org0f8a5cb">Appups and Relups</a></li>
<li><a href="#generating-releases-and-upgrades-with-elixir">Generating Releases and Upgrades with Elixir</a></li>
</ul>
</li>
<li><a href="#org81af065">Summary</a></li>
</ul>
</div>
</div>
<div class="PREVIEW">
<p>
One of the untold benefits of having a runtime is the ability for that runtime
to enable loading and unloading code while the runtime is active.  Since the
runtime is itself, essentially, a virtual machine with its own operating system
and process scheduling, it has the ability to start and stop, load and unload
processes and code similar to how "real" operating systems do.
</p>

</div>

<div class="embed-video">
<iframe width="560" height="315"
src="https://www.youtube.com/embed/xrIjfIjssLE?rel=0"
frameborder="0" allow="autoplay; encrypted-media"
allowfullscreen></iframe></div>

<blockquote>
<p>
Warning, there be black magic here.
</p>
</blockquote>

<p>
This enables some spectacular power in terms of creating deployments and
rolling out those deployments.  That is, if we can provide a particular
artifact for the runtime to load and replace the running system with, we can
instruct it to upgrade our system(s) <i>without</i> restarting them, without
interrupting our services or affecting users of those systems.  Furthermore, if
we constrain the system and make a few particular assumptions, this can all
happen nearly instantaneously.  For example, Erlang releases happen in seconds
because of the functional approach taken by the language, this compared to
other systems like <a href="https://docker.com">Docker</a> and/or <a href="http://kubernetes.io/">Kubernetes</a> which
may take several minutes or hours to transition a version because there is no
safe assumptions to make about running code.
</p>

<p>
This post will be a small tour through how Elixir and Erlang can perform code
hot swapping, and how this can be useful for deployments.
</p>

<div id="outline-container-org1916d6b" class="outline-2">
<h2 id="org1916d6b">Hot Code Swapping: Basics</h2>
<div class="outline-text-2" id="text-org1916d6b">
<p>
There are several functions defined in the <a href="http://erlang.org/doc/man/sys.html"><code>:sys</code></a> and
<a href="http://erlang.org/doc/man/code.html"><code>:code</code></a> modules that are required for this first example.
Namely, the following functions:
</p>

<ul class="org-ul">
<li><code>:code.load_file/1</code></li>

<li><code>:sys.suspend/1</code></li>

<li><code>:sys.change_code/4</code></li>

<li><code>:sys.resume/1</code></li>
</ul>

<p>
The <code>:sys.suspend/1</code> function takes a single parameter, the Process ID
(PID) of the process to suspend, similarly, <code>:sys.resume</code> also takes a
PID of the process to resume.  The <code>:code.load_file/1</code> function,
unfortunately named, takes a single parameter: the <i>module</i> to load into
memory.  Finally, the <code>:sys.change_code</code> function takes four parameters:
<code>name</code>, <code>module</code>, <code>old_version</code>, and <code>extra</code>.  The <code>name</code> is the PID or
the registered atom of the process.  The <code>extra</code> argument is a reserved
parameter for each process, it's the same <code>extra</code> that will be passed to
the restarted process's <code>code_change/3</code> function.
</p>
</div>
