blog/2016/12/elixir-hot-swapping/index.html

<div id="outline-container-org7474a29" class="outline-3">
<h3 id="org7474a29">Example</h3>
<div class="outline-text-3" id="text-org7474a29">
<p>
Let's assume we have a particularly simple module, say <code>KV</code>, similar to
the following:
</p>

<pre class="example">
defmodule KV do
  use GenServer

  @vsn 0

  def start_link() do
    GenServer.start_link(__MODULE__, [], name: __MODULE__)
  end

  def init(_) do
    {:ok, %{}}
  end

  def get(key, default \\ nil) do
    GenServer.call(__MODULE__, {:get, key, default})
  end

  def put(key, value) do
    GenServer.call(__MODULE__, {:put, key, value})
  end

  def handle_call({:get, key, default}, _caller, state) do
    {:reply, Map.get(state, key, default), state}
  end

  def handle_call({:put, key, value}, _caller, state) do
    {:reply, :ok, Map.put(state, key, value)}
  end

end
</pre>

<p>
Save this into a file, say, <code>kv.ex</code>.  Next we will compile it and load it
into an <code>iex</code> session:
</p>

<pre class="example">
% elixirc kv.ex
% iex
iex&gt; l KV
{:module, KV}
</pre>

<p>
We can start the process and try it out:
</p>

<pre class="example">
iex&gt; KV.start_link
{:ok, #PID&lt;0.84.0&gt;}
iex&gt; KV.get(:a)
nil
iex&gt; KV.put(:a, 42)
:ok
iex&gt; KV.get(:a)
42
</pre>

<p>
Now, let's say we wish to add some logging to the handling of the <code>:get</code>
and <code>:put</code> messages.  We will apply a patch similar to the following:
</p>

<pre class="example">
--- a/kv.ex
+++ b/kv.ex
@@ -1,7 +1,8 @@
 defmodule KV do
+  require Logger
   use GenServer

-  @vsn 0
+  @vsn 1

   def start_link() do
     GenServer.start_link(__MODULE__, [], name: __MODULE__)
@@ -20,10 +21,12 @@ defmodule KV do
   end

   def handle_call({:get, key, default}, _caller, state) do
+    Logger.info("#{__MODULE__}: Handling get request for #{key}")
     {:reply, Map.get(state, key, default), state}
   end

   def handle_call({:put, key, value}, _caller, state) do
+    Logger.info("#{__MODULE__}: Handling put request for #{key}:#{value}")
     {:reply, :ok, Map.put(state, key, value)}
   end
</pre>

<p>
Without closing the current <code>iex</code> session, apply the patch to the file
and compile the module:
</p>

<pre class="example">
% patch kv.ex kv.ex.patch
% elixirc kv.ex
</pre>

<blockquote>
<p>
You may see a warning about redefining an existing module, this
warning can be safely ignored.
</p>
</blockquote>

<p>
Now, in the still open <code>iex</code> session, let's begin the black magic
incantations:
</p>

<pre class="example">
iex&gt; :code.load_file KV
{:module, KV}
iex&gt; :sys.suspend(KV)
:ok
iex&gt; :sys.change_code(KV, KV, 0, nil)
:ok
iex&gt; :sys.resume(KV)
:ok
</pre>

<p>
Now, we should be able to test it again:
</p>

<pre class="example">
iex&gt; KV.get(:a)
21:28:47.989 [info]  Elixir.KV: Handling get request for a
42
iex&gt; KV.put(:b, 2)
21:28:53.729 [info]  Elixir.KV: Handling put request for b:2
:ok
</pre>

<p>
Thus, we are able to hot-swap running code, without stopping, losing
state, or effecting processes waiting for that data!
</p>

<p>
But the above is merely an example of manually invoking the code
reloading API, there are better ways to achieve the same result.
</p>
</div>
</div>

<div id="outline-container-org78361c9" class="outline-3">
<h3 id="org78361c9">Example: <code>iex</code></h3>
<div class="outline-text-3" id="text-org78361c9">
<p>
There are several functions available to us when using <code>iex</code> that
essentially perform the above actions for us:
</p>

<ul class="org-ul">
<li><code>c/1</code>: compile file</li>

<li><code>r/1</code>: (recompile and) reload module</li>
</ul>

<p>
The <code>r/1</code> helper takes an atom of the module to reload, <code>c/1</code> takes a binary of
the path to the module to compile.  Check the
<a href="http://elixir-lang.org/docs/stable/iex/IEx.Helpers.html">documentation</a> for more information.
</p>

<p>
Therefore, using these, we can simplify what we did in the previous example to
simply a call to <code>r/1</code>:
</p>

<pre class="example">
iex&gt; r KV
warning: redefining module KV (current version loaded from Elixir.KV.beam)
  kv.ex:1

{:reloaded, KV, [KV]}
iex&gt; KV.get(:a)

21:52:47.829 [info]  Elixir.KV: Handling get request for a
42
</pre>

<p>
In one function, we have done what previously took four functions.  However,
the story does not end here.  This was only for a single module, one
<code>GenServer</code>.  What about when we want to upgrade more modules, or an entire
application?
</p>

<blockquote>
<p>
Although <code>c/1</code> and <code>r/1</code> are great for development.  They are <i>not</i>
recommended for production use.  Do not depend on them to perform
deployments.
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-org6815fb9" class="outline-2">
<h2 id="org6815fb9">Relups</h2>
<div class="outline-text-2" id="text-org6815fb9">
<p>
Fortunately, there is another set of tooling that allows us to more
easily deploy releases, and more pointedly, perform upgrades: Relups.
Before we dive straight into relups, let's discuss a few other related
concepts.
</p>
</div>

<div id="outline-container-orgd5c368f" class="outline-3">
<h3 id="orgd5c368f">Erlang Applications</h3>
<div class="outline-text-3" id="text-orgd5c368f">
<p>
As part of Erlang "Applications", there is a related file, the
<a href="http://erlang.org/doc/man/app.html"><code>.app</code></a> file.  This resource file describes the application:
other applications that should be started and other metadata about the
application.  Using Elixir, this file can be found in the
<code>_build/{Mix.env}/lib/{app_name}/ebin/</code> folder.
</p>

<p>
Here's an example <code>.app</code> file from the <a href="https://git.devnulllabs.io/demos/octochat.git">octochat</a> demo
application:
</p>

<pre class="example">
± cat _build/dev/lib/octochat/ebin/octochat.app
{application,octochat,
         [{registered,[]},
          {description,"Demo Application for How Swapping Code"},
          {vsn,"0.3.3"},
          {modules,['Elixir.Octochat','Elixir.Octochat.Acceptor',
                    'Elixir.Octochat.Application','Elixir.Octochat.Echo',
                    'Elixir.Octochat.ServerSupervisor',
                    'Elixir.Octochat.Supervisor']},
          {applications,[kernel,stdlib,elixir,logger]},
          {mod,{'Elixir.Octochat.Application',[]}}]}.
</pre>

<p>
This is a pretty good sized triple (3-tuple).  By the first element of the
triple, we can tell it is an <code>application</code>, the application's name is
<code>octochat</code> given by the second element, and everything in the list that follows
is a keyword list that describes more about the <code>octochat</code>
application.  Notably, we have the usual metadata found in the <code>mix.exs</code> file,
the <code>modules</code> that make up the application, and the other OTP applications this
application requires to run.
</p>
</div>
</div>

<div id="outline-container-org20dfb92" class="outline-3">
<h3 id="org20dfb92">Erlang Releases</h3>
<div class="outline-text-3" id="text-org20dfb92">
<p>
An Erlang "release", similar to Erlang application, is an entire system: the
Erlang VM, the dependent set of applications, and arguments for the Erlang VM.
</p>

<p>
After building a release for the Octochat application with the
<a href="https://github.com/bitwalker/distillery"><code>distillery</code></a> project, we get a <code>.rel</code> file similar to the
following:
</p>

<pre class="example">
± cat rel/octochat/releases/0.3.3/octochat.rel
{release,{"octochat","0.3.3"},
     {erts,"8.1"},
     [{logger,"1.3.4"},
      {compiler,"7.0.2"},
      {elixir,"1.3.4"},
      {stdlib,"3.1"},
      {kernel,"5.1"},
      {octochat,"0.3.3"},
      {iex,"1.3.4"},
      {sasl,"3.0.1"}]}.
</pre>

<p>
This is an Erlang 4-tuple; it's a <code>release</code> of the <code>"0.0.3"</code> version of
<code>octochat</code>.  It will use the <code>"8.1"</code> version of "erts" and it depends on the
list of applications (and their versions) provided in the last element of the
tuple.
</p>
</div>
</div>
