blog/2016/12/elixir-hot-swapping/index.html

<div id="outline-container-org0f8a5cb" class="outline-3">
<h3 id="org0f8a5cb">Appups and Relups</h3>
<div class="outline-text-3" id="text-org0f8a5cb">
<p>
As the naming might suggest, "appups" and "relups" are the "upgrade"
versions of applications and releases, respectively.  Appups describe how
to take a single application and upgrade its modules, specifically, it
will have instructions for upgrading modules that require "extras". or,
if we are upgrading supervisors, for example, the Appup will have the
correct instructions for adding and removing child processes.
</p>

<p>
Before we examine some examples of these files, let's first look at the
type specification for each.
</p>

<p>
Here is the syntax structure for the <code>appup</code> resource file:
</p>

<pre class="example">
{Vsn,
  [{UpFromVsn, Instructions}, ...],
  [{DownToVsn, Instructions}, ...]}.
</pre>

<p>
The first element of the triple is the version we are either upgrading to or
downgrading from.  The second element is a keyword list of upgrade instructions
keyed by the version the application would be coming <i>from</i>.  Similarly, the
third element is a keyword list of downgrade instructions keyed by the version
the application will downgrade <i>to</i>.  For more information about the types
themselves, see the <a href="http://erlang.org/doc/man/appup.html">SASL documentation</a>.
</p>

<p>
Now that we have seen the syntax, let's look at an example of the appup
resource file for the octochat application generated using
<a href="https://github.com/bitwalker/distillery">distillery</a>:
</p>

<pre class="example">
± cat rel/octochat/lib/octochat-0.2.1/ebin/octochat.appup
{"0.2.1",
 [{"0.2.0",[{load_module,'Elixir.Octochat.Echo',[]}]}],
 [{"0.2.0",[{load_module,'Elixir.Octochat.Echo',[]}]}]}.
</pre>

<p>
Comparing this to the syntax structure above, we see that we have a <code>Vsn</code>
element of <code>"0.2.1"</code>, we have a <code>{UpFromVsn, Instructions}</code> pair:
<code>[{"0.2.0",[{load_module,'Elixir.Octochat.Echo',[]}]}]</code>, and we have a single
<code>{DownToVsn, Instructions}</code> pair:
<code>[{"0.2.0",[{load_module,'Elixir.Octochat.Echo',[]}]}]</code>.
</p>

<p>
The instructions themselves tell us what exactly is required to go from one
version to the another.  Specifically, in this example, to upgrade, we need to
"load" the <code>Octochat.Echo</code> module into the VM.  Similarly, the instructions to
downgrade are the same.  For a <a href="http://semver.org">semantically versioned</a>
project, this is an understandably small change.
</p>

<p>
It's worth noting the instructions found in the <code>.appup</code> files are
usually high-level instructions, thus, <code>load_module</code> covers both the
loading of object code into memory and the suspend, replace, resume
process of upgrading applications.
</p>

<p>
Next, let's look at the syntax structure of a <code>relup</code> resource file:
</p>

<pre class="example">
{Vsn,
 [{UpFromVsn, Descr, Instructions}, ...],
 [{DownToVsn, Descr, Instructions}, ...]}.
</pre>

<p>
This should look familiar.  It's essentially the exact same as the
<code>.appup</code> file.  However, there's an extra term, <code>Descr</code>.  The <code>Descr</code>
field can be used as part of the version identification, but is
optional.  Otherwise, the syntax of this file is the same as the
<code>.appup</code>.
</p>

<p>
Now, let's look at an example <code>relup</code> file for the same release of
octochat:
</p>

<pre class="example">
± cat rel/octochat/releases/0.2.1/relup
{"0.2.1",
 [{"0.2.0",[],
   [{load_object_code,{octochat,"0.2.1",['Elixir.Octochat.Echo']}},
    point_of_no_return,
    {load,{'Elixir.Octochat.Echo',brutal_purge,brutal_purge}}]}],
 [{"0.2.0",[],
   [{load_object_code,{octochat,"0.2.0",['Elixir.Octochat.Echo']}},
    point_of_no_return,
    {load,{'Elixir.Octochat.Echo',brutal_purge,brutal_purge}}]}]}.
</pre>

<p>
This file is a little more dense, but still adheres to the basic triple syntax
we just examined.  Let's take a closer look at the upgrade instructions:
</p>

<pre class="example">
[{load_object_code,{octochat,"0.2.1",['Elixir.Octochat.Echo']}},
 point_of_no_return,
 {load,{'Elixir.Octochat.Echo',brutal_purge,brutal_purge}}]
</pre>

<p>
The first instruction,
<code>{load_object_code,{octochat,"0.2.1",['Elixir.Octochat.Echo']}}</code>, tells the
<a href="http://erlang.org/doc/man/release_handler.html">release handler</a> to load into memory the new
version of the "Octochat.Echo" module, specifically the one associated with
version "0.2.1".  But this instruction will not instruct the release handler to
(re)start or replace the existing module yet.  Next, <code>point_of_no_return</code>, tells
the release handler that failure beyond this point is fatal, if the upgrade
fails after this point, the system is restarted from the old release version
(<a href="http://erlang.org/doc/man/appup.html">appup documentation</a>).  The final instruction,
<code>{load,{'Elixir.Octochat.Echo',brutal_purge,brutal_purge}}</code>, tells the release
handler to replace the running version of the module and use the newly loaded
version.
</p>

<p>
For more information regarding <code>burtal_purge</code>, check out the "PrePurge" and
"PostPurge" values in the <a href="http://erlang.org/doc/man/appup.html">appup documentation</a>.
</p>

<p>
Similar to the <code>.appup</code> file, the third element in the triple describes to the
release handler how to downgrade the release as well.  The version numbers in
this case make this a bit more obvious as well, however, the steps are
essentially the same.
</p>
</div>
</div>
