blog/2016/12/elixir-hot-swapping/index.html

<div id="outline-container-org9262994" class="outline-3">
<h3 id="generating-releases-and-upgrades-with-elixir">Generating Releases and Upgrades with Elixir</h3>
<div class="outline-text-3" id="text-generating-releases-and-upgrades-with-elixir">
<p>
Now that we have some basic understanding of releases and upgrades, let's see
how we can generate them with Elixir.  We will generate the releases with the
<a href="https://github.com/bitwalker/distillery">distillery</a> project, however, the commands should also work with
the soon to be deprecated <a href="https://github.com/bitwalker/exrm">exrm</a> project.
</p>

<blockquote>
<p>
This has been written for the <code>0.10.1</code> version of
<a href="https://github.com/bitwalker/distillery">distillery</a>.  This is a
fast moving project that is in beta, be prepared to update as
necessary.
</p>
</blockquote>

<p>
Add the <a href="https://github.com/bitwalker/distillery">distillery</a> application to your <code>deps</code> list:
</p>

<pre class="example">
{:distillery, "~&gt; 0.10"}
</pre>

<p>
Perform the requisite dependency download:
</p>

<pre class="example">
± mix deps.get
</pre>

<p>
Then, to build your first production release, you can use the following:
</p>

<pre class="example">
± MIX_ENV=prod mix release --env prod
</pre>

<blockquote>
<p>
For more information on why you must specify both environments, please read
the <a href="https://hexdocs.pm/distillery/common-issues.html#why-do-i-have-to-set-both-mix_env-and-env">FAQ</a> of distillery.  If the environments match,
there's a small modification to the <code>./rel/config.exs</code> that can be made so
that specifying both is no longer necessary.
</p>
</blockquote>

<p>
After this process is complete, there should be a new folder under the <code>./rel</code>
folder that contains the new release of the project.  Within this directory,
there will be several directories, namely, <code>bin</code>, <code>erts-{version}</code>, <code>lib</code>, and
<code>releases</code>.  The <code>bin</code> directory will contain the top level Erlang entry
scripts, the <code>erts-{version}</code> folder will contain the requisite files for the
Erlang runtime, the <code>lib</code> folder will contain the compiled beam files for the
required applications for the release, and finally, the <code>releases</code> folder will
contain the versions of the releases.  Each folder for each version will have
its own <code>rel</code> file, generated boot scripts, as per the
<a href="http://erlang.org/doc/design_principles/release_structure.html">OTP releases guide</a>, and a tarball of the release
for deployment.
</p>

<p>
Deploying the release is a little out of scope for this post and may be the
subject of another.  For more information about releases, see the
<a href="http://erlang.org/doc/system_principles/create_target.html">System Principles</a> guide.  However, for
Elixir, it may look similar to the following:
</p>

<ul class="org-ul">
<li><p>
Copy the release tarball to the target system:
</p>

<pre class="example">
± scp rel/octochat/releases/0.3.2/octochat.tar.gz target_system:/opt/apps/.
</pre></li>

<li><p>
On the target system, unpack the release:
</p>

<pre class="example">
± ssh target_system
(ts)# cd /opt/apps
(ts)# mkdir -p octochat
(ts)# tar -zxf octochat.tar.gz -C octochat
</pre></li>

<li><p>
Start the system:
</p>

<pre class="example">
(ts)# cd octochat
(ts)# bin/octochat start
</pre></li>
</ul>

<p>
This will bring up the Erlang VM and the application tree on the target system.
</p>

<p>
Next, after making some applications changes and bumping the project version,
we can generate an upgrade release using the following command:
</p>

<pre class="example">
± MIX_ENV=prod mix release --upgrade
</pre>

<blockquote>
<p>
Note, This will <i>also</i> generate a regular release.
</p>
</blockquote>

<p>
Once this process finishes, checking the <code>rel/{app_name}/releases</code> folder,
there should be a new folder for the new version, and a <code>relup</code> file for the
upgrade:
</p>

<pre class="example">
± cat rel/octochat/releases/0.3.3/octochat.rel
{release,{"octochat","0.3.3"},
     {erts,"8.1"},
     [{logger,"1.3.4"},
      {compiler,"7.0.2"},
      {elixir,"1.3.4"},
      {stdlib,"3.1"},
      {kernel,"5.1"},
      {octochat,"0.3.3"},
      {iex,"1.3.4"},
      {sasl,"3.0.1"}]}.

± cat rel/octochat/releases/0.3.3/relup
{"0.3.3",
 [{"0.3.2",[],
   [{load_object_code,{octochat,"0.3.3",['Elixir.Octochat.Echo']}},
    point_of_no_return,
    {suspend,['Elixir.Octochat.Echo']},
    {load,{'Elixir.Octochat.Echo',brutal_purge,brutal_purge}},
    {code_change,up,[{'Elixir.Octochat.Echo',[]}]},
    {resume,['Elixir.Octochat.Echo']}]}],
 [{"0.3.2",[],
   [{load_object_code,{octochat,"0.3.1",['Elixir.Octochat.Echo']}},
    point_of_no_return,
    {suspend,['Elixir.Octochat.Echo']},
    {code_change,down,[{'Elixir.Octochat.Echo',[]}]},
    {load,{'Elixir.Octochat.Echo',brutal_purge,brutal_purge}},
    {resume,['Elixir.Octochat.Echo']}]}]}.
</pre>

<p>
Similarly, to deploy this new upgrade, copy the tarball to the target system
and unpack it into the same directory as before.
</p>

<p>
After it's unpacked, upgrading the release can be done via a stop and start, or
we can issue the <code>upgrade</code> command:
</p>

<pre class="example">
(ts)# bin/octochat stop
(ts)# bin/octochat start
</pre>

<p>
Or:
</p>

<pre class="example">
(ts)# bin/octochat upgrade "0.3.3"
</pre>

<p>
When starting and stopping, the entry point script knows how to select the
"newest" version.
</p>

<p>
When upgrading, it is required to specify the desired version, this is
necessary since the upgrade process may require more than simply jumping to the
"latest" version.
</p>
</div>
</div>
</div>

<div id="outline-container-org81af065" class="outline-2">
<h2 id="org81af065">Summary</h2>
<div class="outline-text-2" id="text-org81af065">
<p>
Release management is a complex topic, upgrading without restarting seemingly
even more so.  However, the process <i>can</i> be understood, and knowing how the
process works will allow us to make more informed decisions regarding when to
use it.
</p>

<p>
The tooling for performing hot upgrades has been around for a while, and while
the tooling for Elixir is getting closer, we are not quite ready for prime
time.  But it won't remain this way for long.  Soon, it will be common place
for Elixir applications to be just as manageable as the Erlang counterparts.
</p>
</div>
</div>
</div>
<footer id="" class="status">
<footer>
  <p>&copy; 2014-2023 Kenny Ballou.
    <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Some rights
      reserved.</a></p>
  <p>Powered by <a href="https://gnu.org">GNU/Linux</a></p>
</footer>
</footer>
</body>
</html>
